#############################################################################################################################################################################################################################################################################################################################################################################################################################################
# ГЛАВА 1 "Разлом"
#############################################################################################################################################################################################################################################################################################################################################################################################################################################

label prolog:
    show screen db_quick_menu with dissolve
    stop music fadeout 1
    window hide
    scene black
    pause 2
    call screen episode_1
    screen episode_1:
        timer 11.5 action Return()
        key "dismiss" action Return()
        
        text _("Эпизод первый"):
            align (0.5, 0.45)
            size 100
            font ag_font_cour
            outlines [ (2, "#000", 2, 2) ]
            at transform:
                alpha 0
                linear 1.5 alpha 1.0
                pause 3.0
                linear 1.5 alpha 0.0

        text _("Разлом"):
            align (0.5, 0.55)
            size 100
            font ag_font_cour
            outlines [ (2, "#000", 2, 2) ]
            at transform:
                alpha 0
                pause 1.0
                linear 1.5 alpha 1.0
                pause 1.5
                linear 2 alpha 0.0

        text _("18.02.2014"):
            align (0.5, 0.5)
            size 100
            font ag_font_cour
            outlines [ (2, "#000", 2, 2) ]
            at transform:
                alpha 0
                pause 6.5
                linear 1.5 alpha 1.0
                pause 1.5
                linear 1.5 alpha 0.0
    play music "music/egorgez - 12.mp3" loop
    show zal_db with dissolve
    pause 1
    "Февраль." with dissolve
    "18 число." with dissolve
    "Я иду по улице смотря на фонари которые подсвечивают маленькие снежинки падающие на землю." with dissolve
    "Типичный зимний вечер." with dissolve
    "По дороге домой решил забежать в магазин, за пельменями." with dissolve
    "у нас в доме есть маленький магазинчик, но зато в нём есть всё что надо для жизни." with dissolve
    play sound dver_d
    pause 2
    play sound magazin_kolokolcik
    "Я открыл дверь, надо мной звонко прозвучал колокольчик и я зашёл в магазин." with dissolve
    zn "Добрый вечер, тёть Люд."
    tl "Привет, Жень.!"
    zn "Пельмешки мои любимые есть?"
    tl "Конечно есть, сегодня привезли, свееежие!)"
    "С добротой сказала Тётя Люда."
    zn "Отлично, дайте мне пачку пожалуйста."
    tl "Секунду, сейчас с морозилки достану."
    "С тётей Людой, продавщицой я знаком ещё с самого детсва."
    "Помню как покупал жвачки Турбо с вкладышами машинками."
    "Эхх, было время."
    "Пока я задумался, перед мной появилась тётя Люда с пачкой пельменей в руках."
    tl "Вот, держи, с тебя 22,50."
    zn "Секунду."
    play sound bymaga_skomkana
    "Я начал копаться в кармане, достал деньги и положил деньги на прилавок."
    zn "Вот, сегодня даже без сдачи."
    tl "Хорошо, удачи там, а то по новостям какие то ужасы передают."
    zn "Надо будет глянуть что там."
    zn "Давайте, я пошёл"
    tl "Давай, давай."
    play sound dver_k
    "Я вышел с магазина и пошёл в сторону подьезда"
    zn "Наконец-то почти дошёл..."
    "Покопавшись в кармане я нашёл ключь и приставил его к домофону"
    play sound zvuk_domofona
    "Дверь открылась и я вошёл"
    "Когда я зашёл в подьезд, я почустовал запах жареной картошки"
    play sound lestnica fadeout 3 loop
    zn "Эхх.. Сейчас бы картошечки навернуть..."
    "Я поднялся по ступенькам, подошёл к квартире, и нажал на кнопку звонка"
    stop sound fadeout 3
    pause 2
    play sound dver_zvonok
    pause 3
    play sound dver_d
    pause 2
    play sound dver_k
    "Я зашёл домой, и повернул голову направо, на зал"
    "Отец как обычно сидел перед телевизором и слушал новости." with dissolve 
    "Я стоял в проходе в зал, и думал о том что сейчас происходит в столице." with dissolve
    "Думая об этом, на фоне говорит ведущая телеканала, на антресоли лежит пыль, а люстра светит тёплым светом напоминая о старых временах." with dissolve
    "Отец что то ворчал себе под нос - в прочеем как всегда" with dissolve
    "Когда я понял что смотрю в одну точку потерявшись в своих мыслях, решил прислушаться о чём говорит ведущая." with dissolve
    play sound "music/zvyki/TV.mp3" fadeout 1 loop
    show tvs_db with dissolve
    pause 1 
    
    
    window hide

    tvid_nvl "Ситуация в Киеве меняется.{p} 
    Теперь правоохранительные органы вплотную подошли к Майдану Независимости. Прямо сейчас в горячей точке находиться наш кореспондент Борис Сачалко. Борис, что у вас там происходит? Ведь уже в шесть вечера истекает срок, который силовики дали чтобы остановить столкновения" with dissolve
    nvl clear # Очищает экран перед следующим блоком текста
    window hide
    
    scene tvm_db with dissolve
    tvzh "Добрый вечер, студия.{p} 
    На Майдане Независимости становиться всё горячее: ситуация начала обостряться где-то чуть больше часа назад. Сотрудники милиции начали прорывать баррикады на улице Грушевского." with dissolve
    tvzh "Митингующие около двадцати минут пытались остановить их коктейлями Молотова, но безуспешно." with dissolve
    tvzh "Под натиском милиции митингующие, находившиеся там, отступили на Майдан Независимости." with dissolve
    scene tvmit1_db with dissolve
    mit1 "Они перешли в наступление с двух сторон-со стороны улицы Банковой. Как видите, по людям уже стреляют, много раненых." with dissolve
    scene tvm_db with dissolve
    tvzh "Буквально через пять минут началось контрнаступление по улице институтской. Оно было настолько интенсивным, что митингующие не успевали забирать своих раненых." with dissolve
    scene tvmit2_db with dissolve
    mit2 "ОНИ НЕ ДАЛИ ВЫТАЩИТЬ ЛЮДЕЙ! СОТНИ-ОКОЛО 150 ЧЕЛОВЕК! ДАВИЛИ ДРУГ ДРУГА, С РАЗБИТЫМИ ГОЛОВАМИ, ИСТЕКАЯ КРОВЬЮ. МЫ НЕ МОГЛИ ИХ ВЫТАЩИТЬ-ОНИ ЛЕЖАЛИ ПОД ТЯЖЕСТЬЮ ТЕЛ!"
    scene tvm_db with dissolve
    tvzh "Точное число раненых митингующих не называют, посколько оно постоянно увеличиваеться. Пострадавших доставляют в местный госпиталь каждые три-четыре минуты. Ещё утром появилась информация о двух погибших митингующих."
    scene tvs_db with dissolve
    tvid "Спасибо, Борис, будьте осторожны. И к другим новостям: в Киеве закрыли метро-все станции столичного метрополитена закрыты на вход и выход. на дорогах десятибальные пробки, город фактически встал. Относительно свободно передвигаються лишь на левом берегу Киева, городской..."
     
    
    scene zal_db with dissolve
    "Отец снова бормотал себе что то под нос" #РЕД
    stop sound fadeout 1
    ot "Суки..." #РЕД
    ot "Как так можно с людьми..?" #РЕД
    "В комнате повисло молчание, и лишь ведущая что то продолжает говорить." #РЕД
    "Если честно я даже не знал что делать в этот момент" #РЕД
    "Я молча стоял в ступоре пару минут,  не мог поверить, как силовики расстреливают людей. Быстро накинув куртку я вышел из подъезда, направившись в сторону бара."
    play sound sneg fadeout 2 loop
    "На улицах моего Донецка было всё спокойно, ничего не предвещало беды."
    "Проходя мимо школы я заметил одну странную деталь - на флагштоке флага Украины не было, когда рядом развивался флаги региона, будто украинский флаг кто-то специально снял."
    zn "Бывает. Может шпана балуется"
    "сказал я, махнув рукой, не предавая этому особого значения."
    "Пройдя ещё немного я подошёл к бару и зашёл внутрь."
    stop sound fadeout 3
    "Глядя новости и на весь пиздец что происходит в мире, бар был единственным местом где я мог бы уйти от этих новостей."
    play sound tkan
    "Я повесил куртку на тремпель и сел за барную стойку."
    "Заказав стакан хорошего виски, рядом со мной присел мужик."
    "Сначала я не понял кто это, но он показался мне знакомым..."
    " и тут к нам подсел ещё один мужчина, и когда я увидел их рядом, я вспомнил!"
    "Это же мои братаны с армии!"
    zn "Витя! Андрюха! Как я вас сразу не узнал!"
    andr "Женя?! Точно! Как я мог забыть!"
    vt "Ого, какая встреча!"
    "Андрюха заказал нам по пиву"
    andr "Ну за такую встречу грех не выпить!"
    andr "Сегодня я угощаю, парни"
    "Таким темпом я и не заметил как выпил уже 3 кружки пива"
    zn "Как вы вообще, парни?"
    vt "Я ещё в поиске себя!"
    andr "Так и скажи что байдики гоняешь!"
    "Все посмеялись"
    andr "Я на СТО у друга работаю, хочу в люди выбиться, своё дело открыть!"
    zn "А я как после армейки вернулся в пожарные пошёл"
    vt "Ого, и как?"
    zn "Да потихоньку вообщем"
    "К нам подошли ещё 2 человека."