#############################################################################################################################################################################################################################################################################################################################################################################################################################################
# ГЛАВА 1 "Разлом"
#############################################################################################################################################################################################################################################################################################################################################################################################################################################

# Персонажи пролога

label prolog:
    show screen db_quick_menu with dissolve
    stop music fadeout 1
    window hide
    scene black
    pause 1
    call screen episode_1
    screen episode_1:
        timer 13.5 action Return()
        key "dismiss" action Return()

        # Текст 1: появление (1.0) + пауза (1.5) + исчезновение (1.0) = 3.5 сек
        text _("Эпизод первый\nразлом"):
            align (0.5, 0.45)
            size 100
            font ag_font_cour
            text_align 0.5
            outlines [ (2, "#000", 2, 2) ]
            at transform:
                alpha 0
                linear 1 alpha 1.0
                pause 3
                linear 1 alpha 0.0

        # Текст 2: ждёт окончания первого (3.5), затем так же — итого до 7.0 сек
        text _("Донецк\nДонбасс - Арена"):
            align (0.5, 0.45)
            size 100
            font ag_font_cour
            text_align 0.5
            outlines [ (2, "#000", 2, 2) ]
            at transform:
                alpha 0
                pause 5.5
                linear 1.0 alpha 1.0
                pause 1.5
                linear 1.0 alpha 0.0

        # Текст 3: ждёт окончания второго (до 7.0), затем так же — итого 9.5 сек
        text _("18.02.2012"):
            align (0.5, 0.5)
            size 100
            font ag_font_cour
            outlines [ (2, "#000", 2, 2) ]
            at transform:
                alpha 0
                pause 9.0
                linear 1.0 alpha 1.0
                pause 1.5
                linear 1.0 alpha 0.0
    play music "music/egorgez - 12.mp3" loop

    ##############################################################
    # НАЧАЛО
    ##############################################################

    scene black
    # ЗВУК толпы
    pause 1.0

    "Из черноты появляется белый силуэт бегущей в правую сторону девушки в платье" with dissolve
    # звуки цоканья каблуков (в будущем картинка)
    pause 2.0

    "Силуэт останавливается, снимает каблуки, держа их в руке, бежит дальше" with dissolve
    # ЗВУК каблуки в руке (в будущем картинка)


    "Свисток судьи, вспышкой света и вот толпа\n машущей украинскими флагами и кричащей:{w=1} ГОООООЛ" with dissolve
    # ЗВУК свисток судьи
    # ЗВУК крики толпы 
    pause 2.0

    # Камера переходит на девушку в свадебном платье, с букетом и туфлями в руках, которая стоит и смотрит на стадион, ища глазами кого-то
    pause 2.0

    alena "Ну где ты?..." with dissolve
    pause 1.0

    # Камера переходит на двух ОМОНовцев в краповых беретах, смеющихся
    # ЗВУК смех, стадион
    pause 2.0

    "Они смеются, улыбаются, наблюдая за матчем" with dissolve
    pause 2.0

    "Дмитрий опускает глаза вниз, хлопает товарища по плечу и указывает вниз" with dissolve
    # ЗВУК хлопок по плечу
    pause 2.0

    "Алена показывает на маленькие часики, затем вскидывает вопросительно руки" with dissolve
    pause 2.0

    "Егор неловко улыбается и виновато разводит плечами" with dissolve
    pause 2.0

    "Ещё один гол, толпа закричала" with dissolve
    # ЗВУК: гол, крики толпы (вид стадиона и толпы картинка на будущее)
    pause 2.0

    # Экран гаснет, слышны крики: "украина, украина"
    scene black
    # ЗВУК крики "Украина! Украина!
    pause 2.0

    # Крики затихают, место действия переносится в церковь.
    "В пустом тихом храме слышен голос батюшки, читающего молитву" with dissolve
    # ЗВУК  тишина храма, голос батюшки (пустой храм)
    pause 2.0

    batushka "Дороже и важнее семьи в мире нет ничего." with dissolve

    # Камера переходит на алтарь, у которого стоит пара: девушка в белом и мужчина в костюме.
    # Над ними держат короны (над Егором — Дима, над Алёной — Марина),
    # к ним всем спиной стоит и читает батюшка
    pause 2.0

    batushka "Семья — единение душ двух людей" with dissolve

    # Сзади них стоит мужчина в советской форме капитана
    pause 2.0

    batushka "Единение прошлого..." with dissolve

    # Камера переходит на крупный план лиц молодожёнов и их свидетелей
    pause 2.0

    batushka ".{w=0.1}.{w=0.1}.{w=0.1}и{w=0.5} будущего" with dissolve

    dima "Интересно, с каким счётом закончили..." with dissolve

    alena "Тихо." with dissolve

    "Егор с улыбкой поворачивает голову к Алёне" with dissolve
    pause 1.0

    egor "Ален... Ну кто знал, что матч так долго продлится..." with dissolve

    "Алёна вздохнула, затем улыбнулась и ближе прижалась к Егору" with dissolve
    # ЗВУК вздох
    pause 2.0

    "Батюшка поднял обе руки взывающе к алтарю" with dissolve
    pause 1.5

    batushka "Господи, славой и честью венчай их!" with dissolve

    # Кадр переносится на кольца. Происходит блик
    # ЗВУК звон колоколов
    pause 2.0

    ##############################################################
    # СТЕПЬ. ФЛЕШБЭК
    ##############################################################

    # Из блика кадр становится чёрным, затем из чёрного светом пробивается солнце,
    # показывается степь: жёлтые поля, посадки, терриконы, безоблачное небо,
    # в котором парит беркут
    # ЗВУК ветер в степи, крик беркута
    scene black
    pause 2.0

    prolog_nar "Неплохое выдалось время для семьи Коваленко тогда." with dissolve

    prolog_nar "Та и что для семьи — для всей страны." with dissolve

    prolog_nar "Страны огромной, красивой." with dissolve

    "Дорога, по ней едет машина с донецкими номерами" with dissolve
    # ЗВУК шум проезжающей машины
    pause 2.0

    prolog_nar "Куда ни поедь, везде найдёшь то, что тебе нужно." with dissolve

    prolog_nar "От черниговских золотых куполов до тёплого побережья Ялты" with dissolve

    prolog_nar "От карпатских лесов до промышленного Донбасса" with dissolve

    prolog_nar "Край металлургов и шахтёров," with dissolve

    prolog_nar "Футбола и алых роз," with dissolve

    # Въезд в Донецк со стелой
    # ЗВУК город, машины
    pause 2.0

    prolog_nar "Как же ты красив." with dissolve

    prolog_nar "Как работящ и трудолюбив," with dissolve

    prolog_nar "Как горд за своё дело и за свою историю." with dissolve

    # По улице среди деревьев и кустов роз едет трамвай
    # ЗВУК звон трамвая
    pause 2.0

    prolog_nar "Ты — символ труда, символ преданности." with dissolve

    prolog_nar "Всякое приходится видеть твоим работящим людям:" with dissolve

    prolog_nar "Несправедливость, воровство, бесконечную ругань." with dissolve

    # Дверь подъезда
    # ЗВУК дверь подъезда
    pause 2.0

    prolog_nar "Но это их дом." with dissolve

    # Дверь квартиры
    # ЗВУК дверь квартиры
    pause 2.0

    prolog_nar "Они живут." with dissolve

    # Родительская спальня: незастеленная кровать, на ней лежат фотоальбомы
    # (свадьба отца, маленький Егор, отец в форме, Егор в форме, фото со свадьбы Егора)
    # ЗВУК перелистывание страниц
    pause 2.0

    prolog_nar "Здесь их родные и близкие." with dissolve

    "В шкафу висит форма капитана СА, а рядом — форма Беркута" with dissolve
    pause 2.0

    prolog_nar "Их работа." with dissolve

    "На кухне, в лучах утреннего солнца, за столом сидит и курит отец" with dissolve
    # ЗВУК утро, птицы
    pause 2.0

    prolog_nar "Их жизнь." with dissolve

    # Спальня, окно настежь открыто, Егор и Алёна лежат под одеялом
    pause 2.0

    # Крупный план их лиц
    pause 2.0

    prolog_nar "Их любовь." with dissolve

    # Вид из окна на утренний Донецк
    # ЗВУК утренний город
    pause 2.0

    prolog_nar "Всё это и есть родина. Всё это..." with dissolve
    pause 2.0


